import React from "react";

const About = () => {
  return (
    <div className="about-details section-padding30 flex justify-center items-center m-20 bg-cream">
      <div className="container mx-auto px-6 py-12 bg-white shadow-lg rounded-lg">
        <div className="text-center max-w-3xl mx-auto">
          <h4 className="text-4xl font-extrabold text-darkBrown mb-6">
            About Us
          </h4>
          <p className="text-xl leading-relaxed text-gray-700">
            हमारा चैनल DHARMTANTRA भारतीय परंपरा, साहित्य, इतिहास और धर्मों से
            जुड़े विभिन्न महत्वपूर्ण पहलुओं पर गहन अध्ययन और शोध के आधार पर
            सामग्री प्रस्तुत करता है। भारत की विविधता में एकता की परंपरा, इसकी
            समृद्ध सांस्कृतिक धरोहर और इसके बहुरंगी इतिहास की कहानियों को रोचक
            ढंग से आपके सामने लाना हमारा प्रमुख उद्देश्य है। हम न केवल धार्मिक
            और ऐतिहासिक तथ्यों को रोचक ढंग से प्रस्तुत करने का प्रयास करते हैं,
            बल्कि इस देश की जड़ों में बसे नैतिक और सांस्कृतिक मूल्यों को भी
            उजागर करते हैं। हमारा मानना है कि आज के दौर में नैतिक मूल्यों और
            समाज के प्रति जिम्मेदारी का बोध अत्यधिक महत्वपूर्ण है, और हम अपनी
            सामग्री के माध्यम से इन्हीं विचारों को बढ़ावा देते हैं। चाहे वह
            भारतीय ग्रंथों का ज्ञान हो, ऐतिहासिक धरोहरों का महत्व हो, या फिर
            समाज में निहित नैतिक संदेश हों, हमारा प्रयास आपको शिक्षित और प्रेरित
            करना है। हम अपने दर्शकों को ऐसी जानकारी प्रदान करते हैं जो न केवल
            मनोरंजन करती है, बल्कि उन्हें अपने जीवन में सकारात्मक बदलाव लाने के
            लिए प्रेरित भी करती है। एवं हमारा समर्पण भी आपके हर कदम पर साथ है।
          </p>
        </div>
      </div>
    </div>
  );
};

export default About;
